//----------------------------------------------------------
// file name: ICommand.h
//
// memo: 任意の実行処理を委譲するためのインターフェース
//----------------------------------------------------------

#ifndef	__ICOMMAND_H
#define	__ICOMMAND_H

namespace gift
{

//----------------------------------------------------------
// name: gift::ICommand
//
// attrib: interface
//
// memo: 処理実行の代行者
//----------------------------------------------------------
class	ICommand
{
public:
	virtual ~ICommand(void) {};

	//----------------------------------------------------------
	//	実装先の処理を実行する
	//----------------------------------------------------------
	virtual void Execute(void) = 0;
};

};//namespace gift

#endif
